{
  "common": {
    "yes": "Yes",
    "no": "No"
  },
  "navigation": {
    "links": {
      "home": "me",
      "blog": "blog",
      "projects": "projects"
    }
  },
  "languages": {
    "english": "English",
    "finnish": "Finnish"
  },
  "mainPage": {
    "me": {
      "generalInfo": "I'm a third-year information technology student at Metropolia. I'm passionate about coding, and when I set myself a goal, I'm determined to achieve it. I'm a quick learner who easily picks up new technologies, ensuring I stay adaptable in the changing field of software development. I've always enjoyed creating things from scratch, which is why I find coding so satisfying. I'm punctual, self-driven, and hardworking, but I also enjoy working as part of a team. In my free time, I like to engage in outdoor activities and exercise."
    },
    "typeWriter": {
      "paragraphs": ["Welcome..." , "I'm a fullstack developer", "I'm UI/UX designer", "I'm a cloud enthusiast"]
    },
    "general": {
      "title": "Who am I?",
      "body": [
        "I am a third-year Information Technology student at Metropolia UAS, currently located in Finland. Equipped with excellent soft skills and problem-solving capabilities, I am well-suited for any IT-related job.",
        "I have a strong knowledge of frontend development, transforming stylish and responsive web designs into fully interactive user experiences. The first impression you make with your brand is crucial.",
        "Building servers and APIs with features such as authentication and authorization is another skill I have developed. I enjoy working with backend frameworks to provide long-lasting solutions for server-side needs.",
        "I am comfortable with both NoSQL and SQL databases, enabling me to provide solutions for storing any information your business requires.",
        "All my deployments, including this Next.js app, have been done with AWS cloud services. They offer everything I need for easy deployment and maintenance.",
        "Please get in touch via the contact page, and let’s discuss how I can contribute to your growth."
      ]
    },
    "portfolio": {
      "downloadButton": "Download CV",
      "skills": "Skills",
      "certificates": "Certificates"
    }
  },
  "blogPage": {
    "likes": "likes",
    "comments": "Comments",
    "reply": "Reply:",
    "deleteComment": "Delete comment:",
    "deleteReply": "Delete reply for comment:",
    "confirmation": "Are you sure?",
    "author": "Published by:",
    "newComment": "New Comment",
    "title": "Title",
    "message": "Message"
  },
  "blogCard": {
    "more": "More..."
  },
  "projectPage": {
    "tech": "Tech",
    "intro": "Introduction",
    "myLearnings": "My Learnings",
    "features": "Features"
  },
  "signInAndOutPage": {
    "signIn": "Sign In",
    "notice": "Notice!",
    "noticeText": "To add likes and comments in this application, you need to authorize with Google. Your email address will be securely stored in our database to keep track of your interactions, such as likes and comments. You can delete your profile at any time from the sign-in menu above, which will remove your data from our system.",
    "noticeTextConfirmation": "By pressing 'Sign in with google' you agree to our terms and conditions, including how we handle your data.",
    "signInWithGoogle": "Sign in with Google",
    "signOut": "Sign Out?"
  },
  "buttons": {
    "backToBlogs": "Back to blogs",
    "newComment": "New Comment",
    "submit": "Submit",
    "submitting": "Submitting",
    "send": "Send",
    "sending": "Sending...",
    "delete": "Delete",
    "deleting": "Deleting...",
    "reply": "Reply",
    "replying": "Replying...",
    "cancel": "Cancel"
  },
  "notification": {
    "unexpectedError": "An unexpected error occurred. Please try again.",
    "commentDeleted": "Comment deleted succesfully.",
    "replyAdded": "Reply added succesfully.",
    "commentAdded": "Comment added succesfully. Thank you for your support!",
    "signInFailed": "Please sign in to add blog likes...",
    "blogLikeFailed": "Failed to add blog like, please try again later!",
    "googleSignInFailed": "Sign-in failed. Please try again.",
    "googleSignInOk": "Sign-in successful!",
    "blogLikeOk": "Blog like updated succesfully!",
    "blogLikeDeleted": "Blog like removed."
  }
}
